import React from "react";
import 'bootstrap/dist/css/bootstrap.min.css';




function Answer() {
    return (
        <div>
            <h3>Question : How react Works </h3>
            <h4>Answer : react হচ্ছে   জাভাস্ক্রিপ্টের একটি লাইব্রেরী .  একটি ভার্চুয়াল dom ইউজ করে ব্রাউজার এর মধ্যে .  তারপর সেটি ব্রাউজার এর  dom সাথে কম্পেয়ার করে যখন কোন আপডেট পায় তখন সেই আপডেট ব্রাউজারের মধ্যে সেট করে দেয় এবং react.js
                Jsx  নিয়ে কাজ করে  জেটি পরবর্তীতে জাভাস্ক্রিপ্ট হয়ে ব্রাউজার এর সাথে কাজ করে . সেটি দেখতে এস টি এম এল এর মত
            </h4>

            <h3>Question : Props Vs State </h3>
            <h4>Answer : Props এইচটিএমএল এট্রিবিউট এটি data pass  করে.  এবং এটি হিসেবে 55 করে  এবং এটিকে চেঞ্জ করা যায় না কিন্তু স্টেট একটি ইন্টারেক্টিভ কাজের জন্য ব্যবহার করা হয় অর্থাৎ স্টেট এর মধ্যে কোন ইন্টারেক্টিভ কাজ হলে সেটি আপডেট হয়ে নতুনভাবে চেঞ্জ হয়</h4>



        </div>
    );
}

export default Answer;
